/*задача 15 решена!*/
const cards = [
    '6 червей', '7 червей', '8 червей', '9 червей', '10 червей',
    'Валет червей', 'Дама червей', 'Король червей', 'Туз червей',
    '6 пик', '7 пик', '8 пик', '9 пик', '10 пик',
    'Валет пик', 'Дама пик', 'Король пик', 'Туз пик',
    '6 треф', '7 треф', '8 треф', '9 треф', '10 треф',
    'Валет треф', 'Дама треф', 'Король треф', 'Туз треф',
    '6 бубен', '7 бубен', '8 бубен', '9 бубен', '10 бубен',
    'Валет бубен', 'Дама бубен', 'Король бубен', 'Туз бубен'
];

const cardsFiltered = cards.filter(function (card) {
    /* Впишите код сюда */
    return parseInt(card, 10) && (card.includes('червей') || card.includes('бубен'));

});

console.log(cardsFiltered);
